---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ClosestPointsPairBetweenTwoCurves Constructor
ClosestPointsPairBetweenTwoCurves Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | ClosestPointsPairBetweenTwoCurves()()()() | Obtain a new instance of ClosestPointsPairBetweenTwoCurves class. |
|  | ClosestPointsPairBetweenTwoCurves(ClosestPointsPairBetweenTwoCurves) | Creates a copy of the ClosestPointsPairBetweenTwoCurves. |

# See Also

ClosestPointsPairBetweenTwoCurves Class

ClosestPointsPairBetweenTwoCurves Members

Autodesk.Revit.DB Namespace